app/Http/Controllers/Auth/GithubController.php

    public function returnViewToCompleteRegisteration($user) {

        $userInfos = User::where('id', $user)->get();
---
SELECT * FROM `users` WHERE `id` = '121'

    public function redirect()
    {
        $githubUserInfo = Socialite::driver('github')->stateless()->user();

        $user = User::firstOrCreate(
            [
                'email' => $githubUserInfo->email,

            ],
            [
                'password' => Hash::make(Str::random(24)),
                'role_id' => User::USER_ROLE_CLIENT
            ]
        );
---
INSERT INTO `users` (`email`, `password`, `role_id`, `updated_at`, `created_at`) VALUES ('jeremietavares@hotmail.fr', '$2y$10$KJpSEmwTVMHd2LW81eXqs.E8Tld2aAyxyNH9F5reRDOxwE/NhMUgS', 1, '2022-09-05 05:09:08', '2022-09-05 05:09:08')
SELECT * FROM `users` WHERE (`email` = 'jeremietavares@hotmail.fr') LIMIT 1