app/Http/Controllers/Auth/GoogleController.php

SELECT * FROM `users` WHERE `id` = '113'
---
    public function returnViewToCompleteRegisteration($user)
    {

        $userInfos = User::where('id', $user)->get();

SELECT * FROM `users` WHERE (`email` = 'thioecole@gmail.com') LIMIT 1
---
    public function redirect()
    {

        // STATELESS ? TO BE ADDED IF PROBLEMS
        $googleUserInfo = Socialite::driver('google')->user();
        $roles = new Role;
        $user = User::firstOrCreate(
            [
                'email' => $googleUserInfo->email,
            ],
            [
                'password' => Hash::make(Str::random(24)),
                'role_id' =>  $roles->get_role_client()
            ]
        );