app/Http/Controllers/Auth/oAuthController.php

SELECT * FROM `users` WHERE `email` IS NULL
INSERT INTO `info_users` (`prenom`, `nom`, `telephone`, `rue`, `no_porte`, `code_postal`, `ville`, `updated_at`, `created_at`) VALUES ('qwewqe', 'wqeqwewqe', '432-324-2342', 'wqewqewq', '2', 'j1e4r5', 'ewqwqe', '2022-09-05 21:44:10', '2022-09-05 21:44:10')
---



        $userinfos = User::where('email', $request['email'])->get();

        $newUser = Info_user::create([
            'prenom' => $request['prenom'],
            'nom' => $request['nom'],
            'telephone' => $request['tel'],
            'rue' => $request['rue'],
            'no_porte' => $request['noPorte'],
            'code_postal' => $request['zip-code'],
            'ville' => $request['ville']
        ]);