app/Http/Controllers/Auth/RegisterController.php

    protected function create(array $data)
    {
        $roles = new Role;

        $infoUser = InfoUser::create([
            'prenom' => $data['prenom'],
            'nom' => $data['nom'],
            'telephone' => $data['tel'],
            'rue' => $data['rue'],
            'no_porte' => $data['noPorte'],
            'code_postal' => $data['zip_code'],
            'ville' => $data['ville']
        ]);

        $user = User::create([
            'info_user_id' => $infoUser->id,
            'email' => $data['email'],
            'password' => Hash::make($data['password']),
            'role_id' =>  $roles->get_role_client()
        ]);
---
INSERT INTO `info_users` (`prenom`, `nom`, `telephone`, `rue`, `no_porte`, `code_postal`, `ville`, `updated_at`, `created_at`) VALUES ('qwewqeqw', 'qwqw', '432-324-2342', 'qweqwe', '2', 'j1e4r6', 'wqewqeqw', '2022-09-06 00:20:37', '2022-09-06 00:20:37')
INSERT INTO `users` (`info_user_id`, `email`, `password`, `role_id`, `updated_at`, `created_at`) VALUES (189, 'j@j.j', '$2y$10$sIHcZ911HcXVxOdxaX63yuwX5vcTRNoFw9MZsc1CO2YEIOYZsVT.m', 1, '2022-09-06 00:20:37', '2022-09-06 00:20:37')